In [1]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({'data1': range(7), 'key':list('bbacaab')})
df2 = pd.DataFrame({'data2': range (20,23), 'key': list('abd')})
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [4]:
df2

   data2 key
0     20   a
1     21   b
2     22   d

In [7]:
df1.merge(df2) #De esta manera junto dos data frames

   data1 key  data2
0      0   b     21
1      1   b     21
2      6   b     21
3      2   a     20
4      4   a     20
5      5   a     20

Por dafault, .merge() hace un inner join usando als columnas comunes como keys. Eso implica que devuelve el producto de los elementos con llaves comunes, si estan duplicadas van a devolver todas las convinaciones posibles

In [10]:
df2_wdups = pd.DataFrame({'data2': range(20,25), 'key':list('abdaa')})

df1.merge(df2_wdups)

    data1 key  data2
0       0   b     21
1       1   b     21
2       6   b     21
3       2   a     20
4       2   a     23
5       2   a     24
6       4   a     20
7       4   a     23
8       4   a     24
9       5   a     20
10      5   a     23
11      5   a     24

Si la columna a juntar no tiene el mismo nombre, o queremos juntar los mismos indef del df, necesitaremos expresarlo.

In [11]:
df3 = pd.DataFrame ({'data1' : range(7), 'lkey':list('bbacaab')})
df4 = pd.DataFrame({'data2' : range(20,23), 'rkey' : list('abd')})

In [12]:
df3.merge(df4)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [13]:
df3.merge(df4, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b     21    b
1      1    b     21    b
2      6    b     21    b
3      2    a     20    a
4      4    a     20    a
5      5    a     20    a

In [14]:
df3.merge(df4, left_on='lkey', right_on='rkey', how='outer')

   data1 lkey  data2 rkey
0    0.0    b   21.0    b
1    1.0    b   21.0    b
2    6.0    b   21.0    b
3    2.0    a   20.0    a
4    4.0    a   20.0    a
5    5.0    a   20.0    a
6    3.0    c    NaN  NaN
7    NaN  NaN   22.0    d

In [15]:
df3.merge(df4, left_on='lkey', right_on='rkey', how='left')

   data1 lkey  data2 rkey
0      0    b   21.0    b
1      1    b   21.0    b
2      2    a   20.0    a
3      3    c    NaN  NaN
4      4    a   20.0    a
5      5    a   20.0    a
6      6    b   21.0    b

Si hay dos columnas con el mismo nombre, no se van a juntar, sino que ambas van a tener el resultado del DF con un sufijo.

In [16]:
df1['something'] =54
df2['something']=54
df1

   data1 key  something
0      0   b         54
1      1   b         54
2      2   a         54
3      3   c         54
4      4   a         54
5      5   a         54
6      6   b         54

In [18]:
df1.merge(df2,on='key') #Va a tener un sufijo:

   data1 key  something_x  data2  something_y
0      0   b           54     21           54
1      1   b           54     21           54
2      6   b           54     21           54
3      2   a           54     20           54
4      4   a           54     20           54
5      5   a           54     20           54

In [20]:
df1.merge(df2, on='key', suffixes=('_2017', '_2018')) #Le puedo cambiar el nombre de cada sufijo

   data1 key  something_2017  data2  something_2018
0      0   b              54     21              54
1      1   b              54     21              54
2      6   b              54     21              54
3      2   a              54     20              54
4      4   a              54     20              54
5      5   a              54     20              54

### Merging on index

In [21]:
df5 = pd.DataFrame({'Salary':[40000, 50000, 20000]},
                  index=list('abc'))
df5

   Salary
a   40000
b   50000
c   20000

In [24]:
df1.merge(df5, left_on='key', right_index=True) 
#Junto ambos df y le indico que los que tienen = index que tengan el valor del df5

   data1 key  something  Salary
0      0   b         54   50000
1      1   b         54   50000
6      6   b         54   50000
2      2   a         54   40000
4      4   a         54   40000
5      5   a         54   40000
3      3   c         54   20000

### Concatenating along an axis

In [27]:
pd.concat([df1, df5]) #En vez de unir una columna con datos según el key, añado 3 fials del df5 al df1

C:\Users\ramir\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    Salary  data1  key  something
0      NaN    0.0    b       54.0
1      NaN    1.0    b       54.0
2      NaN    2.0    a       54.0
3      NaN    3.0    c       54.0
4      NaN    4.0    a       54.0
5      NaN    5.0    a       54.0
6      NaN    6.0    b       54.0
a  40000.0    NaN  NaN        NaN
b  50000.0    NaN  NaN        NaN
c  20000.0    NaN  NaN        NaN

In [28]:
pd.concat([df1, df2])

C:\Users\ramir\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   data1  data2 key  something
0    0.0    NaN   b         54
1    1.0    NaN   b         54
2    2.0    NaN   a         54
3    3.0    NaN   c         54
4    4.0    NaN   a         54
5    5.0    NaN   a         54
6    6.0    NaN   b         54
0    NaN   20.0   a         54
1    NaN   21.0   b         54
2    NaN   22.0   d         54

In [30]:
df1 #Pero df1 sigue igual entocnes lo tengo que guardar en una variable

   data1 key  something
0      0   b         54
1      1   b         54
2      2   a         54
3      3   c         54
4      4   a         54
5      5   a         54
6      6   b         54

In [31]:
concatenated = pd.concat([df1, df2], axis=1)
concatenated

   data1 key  something  data2  key  something
0      0   b         54   20.0    a       54.0
1      1   b         54   21.0    b       54.0
2      2   a         54   22.0    d       54.0
3      3   c         54    NaN  NaN        NaN
4      4   a         54    NaN  NaN        NaN
5      5   a         54    NaN  NaN        NaN
6      6   b         54    NaN  NaN        NaN

In [32]:
concatenated['key']

  key  key
0   b    a
1   b    b
2   a    d
3   c  NaN
4   a  NaN
5   a  NaN
6   b  NaN

In [35]:
concatenated.columns = ['one', 'two', 'three', 'four', 
                        'five', 'six']
concatenated

   one two  three  four five   six
0    0   b     54  20.0    a  54.0
1    1   b     54  21.0    b  54.0
2    2   a     54  22.0    d  54.0
3    3   c     54   NaN  NaN   NaN
4    4   a     54   NaN  NaN   NaN
5    5   a     54   NaN  NaN   NaN
6    6   b     54   NaN  NaN   NaN

In [37]:
df2.columns = [ colname + '_df2' for colname in df2.columns]
df2

   data2_df2_df2 key_df2_df2  something_df2_df2
0             20           a                 54
1             21           b                 54
2             22           d                 54

In [38]:
pd.concat([df1, df2])

C:\Users\ramir\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   data1  data2_df2_df2  key key_df2_df2  something  something_df2_df2
0    0.0            NaN    b         NaN       54.0                NaN
1    1.0            NaN    b         NaN       54.0                NaN
2    2.0            NaN    a         NaN       54.0                NaN
3    3.0            NaN    c         NaN       54.0                NaN
4    4.0            NaN    a         NaN       54.0                NaN
5    5.0            NaN    a         NaN       54.0                NaN
6    6.0            NaN    b         NaN       54.0                NaN
0    NaN           20.0  NaN           a        NaN               54.0
1    NaN           21.0  NaN           b        NaN               54.0
2    NaN           22.0  NaN           d        NaN               54.0

In [39]:
import numpy as np

np.concatenate

In [40]:
a1 = np.random.randint(50, size = 20).reshape(5,4)
a1

array([[18, 44, 44,  1],
       [30, 25,  7,  6],
       [20,  5,  8, 21],
       [29, 45, 39, 15],
       [18, 43, 40, 26]])

In [41]:
a2 = np.random.randn(12).reshape(3,4)
a2

array([[-1.92348544,  1.73306086,  0.11959378, -1.25288568],
       [ 0.23191872, -0.43512532, -0.6662596 ,  0.13243844],
       [ 2.32385949, -0.730381  ,  0.42507163, -1.88798301]])

In [43]:
np.concatenate((a1, a2)) #Con la funcion de numpy tambien puedo concatenar arrays

array([[18.        , 44.        , 44.        ,  1.        ],
       [30.        , 25.        ,  7.        ,  6.        ],
       [20.        ,  5.        ,  8.        , 21.        ],
       [29.        , 45.        , 39.        , 15.        ],
       [18.        , 43.        , 40.        , 26.        ],
       [-1.92348544,  1.73306086,  0.11959378, -1.25288568],
       [ 0.23191872, -0.43512532, -0.6662596 ,  0.13243844],
       [ 2.32385949, -0.730381  ,  0.42507163, -1.88798301]])

In [48]:
np.concatenate((a1, a2), axis=1) #Pero en numpy tengo que tener la misma cantidad de filas

ValueError: all the input array dimensions except for the concatenation axis must match exactly

In [49]:
series_1 = pd.Series(range(1, 20, 2), index=list('abcdefghij'))
series_2 = pd.Series(range(5, 26, 5), index=list('jklmn'))
series_3 = pd.Series(range(120, 160, 10), index=list('abpq'))

In [50]:
pd.concat((series_1, series_2, series_3))

a      1
b      3
c      5
d      7
e      9
f     11
g     13
h     15
i     17
j     19
j      5
k     10
l     15
m     20
n     25
a    120
b    130
p    140
q    150
dtype: int64

In [51]:
pd.concat((series_1, series_2, series_3), axis=1) #En pandas no

C:\Users\ramir\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

      0     1      2
a   1.0   NaN  120.0
b   3.0   NaN  130.0
c   5.0   NaN    NaN
d   7.0   NaN    NaN
e   9.0   NaN    NaN
f  11.0   NaN    NaN
g  13.0   NaN    NaN
h  15.0   NaN    NaN
i  17.0   NaN    NaN
j  19.0   5.0    NaN
k   NaN  10.0    NaN
l   NaN  15.0    NaN
m   NaN  20.0    NaN
n   NaN  25.0    NaN
p   NaN   NaN  140.0
q   NaN   NaN  150.0

In [52]:
pd.concat((series_1, series_2, series_3), 
          axis=1, keys=['s1', 's2', 's3'])

C:\Users\ramir\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

     s1    s2     s3
a   1.0   NaN  120.0
b   3.0   NaN  130.0
c   5.0   NaN    NaN
d   7.0   NaN    NaN
e   9.0   NaN    NaN
f  11.0   NaN    NaN
g  13.0   NaN    NaN
h  15.0   NaN    NaN
i  17.0   NaN    NaN
j  19.0   5.0    NaN
k   NaN  10.0    NaN
l   NaN  15.0    NaN
m   NaN  20.0    NaN
n   NaN  25.0    NaN
p   NaN   NaN  140.0
q   NaN   NaN  150.0

In [54]:
pd.concat([df1,df2], ignore_index=True)

C:\Users\ramir\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   data1  data2_df2_df2  key key_df2_df2  something  something_df2_df2
0    0.0            NaN    b         NaN       54.0                NaN
1    1.0            NaN    b         NaN       54.0                NaN
2    2.0            NaN    a         NaN       54.0                NaN
3    3.0            NaN    c         NaN       54.0                NaN
4    4.0            NaN    a         NaN       54.0                NaN
5    5.0            NaN    a         NaN       54.0                NaN
6    6.0            NaN    b         NaN       54.0                NaN
7    NaN           20.0  NaN           a        NaN               54.0
8    NaN           21.0  NaN           b        NaN               54.0
9    NaN           22.0  NaN           d        NaN               54.0

Hay que tener cuidado y no reasignar palabras o funciones reservadas para no reescribir la variable

## Data transformation

### Removing duplicates

In [58]:
import random

random.seed(42)
artists = pd.DataFrame({'name' : ['Camilo'] * 3 + ['Nino'] * 2,
                        'surname' : [random.choice(['Sexto','Bravo']) for _ in range(5)]})

artists

     name surname
0  Camilo   Sexto
1  Camilo   Sexto
2  Camilo   Bravo
3    Nino   Sexto
4    Nino   Sexto

In [60]:
artists.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [62]:
artists[artists.duplicated()] #Que me devuelva lo que ya estaba como df

     name surname
1  Camilo   Sexto
4    Nino   Sexto

In [65]:
artists.drop_duplicates() #Saco los duplicados

     name surname
0  Camilo   Sexto
2  Camilo   Bravo
3    Nino   Sexto

In [69]:
artists.drop_duplicates(keep='last') #Le indico que me elimine los duplicados pero que me mantenga los últimos

     name surname
1  Camilo   Sexto
2  Camilo   Bravo
4    Nino   Sexto

In [70]:
artists['cache'] = [2e5, 5e5, 1e5, 6e6, 8e6]
artists

     name surname      cache
0  Camilo   Sexto   200000.0
1  Camilo   Sexto   500000.0
2  Camilo   Bravo   100000.0
3    Nino   Sexto  6000000.0
4    Nino   Sexto  8000000.0

In [74]:
artists.drop_duplicates() #Ya no me elimina nada

     name surname      cache
0  Camilo   Sexto   200000.0
1  Camilo   Sexto   500000.0
2  Camilo   Bravo   100000.0
3    Nino   Sexto  6000000.0
4    Nino   Sexto  8000000.0

In [75]:
artists.drop_duplicates(subset=['name', 'surname'],keep='first') #Especifico que quiero que me discrimine

     name surname      cache
0  Camilo   Sexto   200000.0
2  Camilo   Bravo   100000.0
3    Nino   Sexto  6000000.0

In [76]:
artists.drop_duplicates(subset=['name', 'surname'],keep='last')

     name surname      cache
1  Camilo   Sexto   500000.0
2  Camilo   Bravo   100000.0
4    Nino   Sexto  8000000.0

### Renaming axis indexes

In [77]:
artists.index = list('abcde')
artists

     name surname      cache
a  Camilo   Sexto   200000.0
b  Camilo   Sexto   500000.0
c  Camilo   Bravo   100000.0
d    Nino   Sexto  6000000.0
e    Nino   Sexto  8000000.0

### Discretization and binning

In [78]:
ages = pd.Series([random.randint(0,90) for _ in range(40)])
ages

0     17
1     13
2     86
3     69
4     11
5     75
6     54
7      4
8      3
9     11
10    27
11    29
12    64
13    77
14     3
15    71
16    25
17    83
18    89
19    69
20    53
21    28
22    57
23    75
24    35
25     0
26    20
27    89
28    54
29    43
30    35
31    19
32    27
33    43
34    13
35    11
36    48
37    12
38    45
39    44
dtype: int64

In [79]:
categorized = pd.cut(ages, 4)
categorized.value_counts()

(-0.089, 22.25]    13
(66.75, 89.0]      10
(22.25, 44.5]      10
(44.5, 66.75]       7
dtype: int64

In [80]:
categorized = pd.cut(ages, [0, 12, 19, 30, 65, 100])
categorized.value_counts().sort_index()

(0, 12]       7
(12, 19]      4
(19, 30]      6
(30, 65]     12
(65, 100]    10
dtype: int64

In [81]:
pd.cut(ages, [0, 12, 19, 30, 65, 100])[0]

Interval(12, 19, closed='right')

## String manipulation

### Vectorized string functions in pandas

[Vectorized string functions in pandas](https://pandas.pydata.org/pandas-docs/stable/text.html) son metodos de los str pero aplicados a pandas.

In [82]:
zoo = pd.DataFrame(
    {'animal' : 'mantisshrimp molerat platypus anteater sloth'.split(),
     'number' : [1234, 40, 3, 1, 2]})

zoo

         animal  number
0  mantisshrimp    1234
1       molerat      40
2      platypus       3
3      anteater       1
4         sloth       2

In [86]:
zoo.upper() #Esto haria con un str normal

AttributeError: 'DataFrame' object has no attribute 'upper'

In [84]:
animals = zoo['animal']
animals.str

In [87]:
animals.str.capitalize()

0    Mantisshrimp
1         Molerat
2        Platypus
3        Anteater
4           Sloth
Name: animal, dtype: object

In [89]:
animals.str.upper()#Esta es la forma de hacerlo con pandas

0    MANTISSHRIMP
1         MOLERAT
2        PLATYPUS
3        ANTEATER
4           SLOTH
Name: animal, dtype: object

In [90]:
animals.str.len()

0    12
1     7
2     8
3     8
4     5
Name: animal, dtype: int64

In [91]:
animals[animals.str.len() > 7]

0    mantisshrimp
2        platypus
3        anteater
Name: animal, dtype: object

In [92]:
animals.str.contains('i')

0     True
1    False
2    False
3    False
4    False
Name: animal, dtype: bool

In [94]:
animals.str.count('o') + animals.str.count('O')

0    0
1    1
2    0
3    0
4    1
Name: animal, dtype: int64

Case insensitive counting:

In [95]:
animals.str.lower().str.count('o')

0    0
1    1
2    0
3    0
4    1
Name: animal, dtype: int64

In [96]:
awful_column_names = pd.Series(['REV   ', '  TAX', '   PASSENGERS   '])

In [97]:
awful_column_names.str.rstrip().values

array(['REV', '  TAX', '   PASSENGERS'], dtype=object)

In [98]:
awful_column_names.str.lstrip().values

array(['REV   ', 'TAX', 'PASSENGERS   '], dtype=object)

In [99]:
awful_column_names.str.strip().values

array(['REV', 'TAX', 'PASSENGERS'], dtype=object)